{
  "frontendSkills": [
    {
      "name": "HTML5 & CSS3",
      "level": "Достаточно хорошо",
      "description": "Создание адаптивных, доступных и семантически структурированных веб-страниц с использованием современных CSS-техник, включая Grid и Flexbox."
    },
    {
      "name": "JavaScript",
      "level": "Достаточно хорошо",
      "description": "Разработка интерактивных веб-приложений с использованием возможностей ES6+, асинхронного программирования и манипуляций с DOM."
    },
    {
      "name": "TypeScript",
      "level": "Неплохо",
      "description": "Разработка типобезопасных приложений с использованием интерфейсов, дженериков и продвинутых возможностей типизации."
    },
    {
      "name": "Angular",
      "level": "Думаю, неплохо",
      "description": "Создание компонентно-ориентированных приложений с использованием сервисов, маршрутизации и управления состоянием."
    },
    {
      "name":"Vue.js",
      "level":"Много",
      "description":"Имею опыт работы с Vue.js, мы используем Vue практически во всех наших проектах."
    },
    {
      "name":"React",
      "level":"Базовые знания",
      "description":"Понимание компонентной архитектуры, хуков и управления состоянием с помощью Redux."
    },
    {
      "name":"SASS/SCSS",
      "level":"Комфортно",
      "description":"Использование препроцессоров для более поддерживаемого и организованного CSS с переменными, миксинами и вложенностью."
    }
  ],
  "backendSkills": [
    {
      "name": "Spring Boot",
      "level": "Немного работал",
      "description": "Разработка серверных приложений с использованием событийно-ориентированной архитектуры и неблокирующих операций ввода-вывода."
    },
    {
      "name": "FastAPI",
      "level": "Более чем достаточно",
      "description": "Создание RESTful API с использованием промежуточного ПО, маршрутизации и обработки ошибок."
    },
    {
      "name": "PostgreSQL",
      "level": "Хорошо разбираюсь",
      "description": "Работа с продвинутыми возможностями реляционных баз данных, включая индексирование, транзакции и хранимые процедуры."
    },
    {
      "name": "SQL",
      "level": "Достаточно хорошо",
      "description": "Работа с реляционными базами данных, написание запросов и управление отношениями в базе данных."
    },
    {
      "name": "Java",
      "level": "Больше чем основы",
      "description": "Разработка корпоративных приложений с использованием Spring Boot и других фреймворков."
    },
    {
      "name": "Python",
      "level": "Текущий активный",
      "description": "Создание скриптов автоматизации, анализ данных и разработка веб-приложений с использованием Django и Flask."
    },
    {
      "name":"C#",
      "level":"Основы",
      "description":"Знание синтаксиса и понимание принципов объектно-ориентированного программирования."
    }
  ],
  "otherSkills": [
    {
      "name": "Git & GitHub",
      "level": "Использую каждый день",
      "description": "Контроль версий, совместная разработка, стратегии ветвления и рабочие процессы CI/CD."
    },
    {
      "name": "RESTful APIs",
      "level": "Стандартный подход",
      "description": "Проектирование и использование API в соответствии с принципами REST, с правильными кодами состояния и обработкой ошибок."
    },
    {
      "name": "Responsive Design",
      "level": "Должен знать",
      "description": "Создание макетов, адаптирующихся к различным размерам экрана, с использованием медиа-запросов и подхода mobile-first."
    },
    {
      "name": "Docker",
      "level": "Делал много раз",
      "description": "Контейнеризация приложений, создание и управление Docker-образами и контейнерами."
    },
    {
      "name": "CI/CD",
      "level": "Несколько раз",
      "description": "Настройка и поддержка конвейеров непрерывной интеграции и доставки с использованием GitHub Actions, GitLab CI/CD и других инструментов."
    },
    {
      "name":"Google Cloud",
      "level":"Имею некоторый опыт",
      "description":"Развернул все наши проекты в BFH в Google Cloud, используя Docker Cloud Run, Cloud SQL и Artifact registry."
    },
    {
      "name":"Agile Методологии",
      "level":"Знания",
      "description":"Плюс работы в университете - была возможность посетить недельные семинары, связанные с управлением проектами по SCRUM и AGILE. Которые я использовал в дальнейшем рабочем процессе."
    }
  ],
  "techStack": [
    "JavaScript",
    "TypeScript",
    "Angular",
    "Vue.js",
    "Vanilla JS",
    "Python",
    "FastAPI",
    "Java",
    "Spring Boot",
    "C#",
    "Git - GitHub/GitLab",
    "Docker",
    "CI/CD"
  ]
}
