{
  "frontendSkills": [
    {
      "name": "HTML5 & CSS3",
      "level": "Достатньо добре",
      "description": "Створення адаптивних, доступних та семантично структурованих веб-сторінок з використанням сучасних CSS-технік, включаючи Grid та Flexbox."
    },
    {
      "name": "JavaScript",
      "level": "Достатньо добре",
      "description": "Розробка інтерактивних веб-додатків з використанням можливостей ES6+, асинхронного програмування та маніпуляцій з DOM."
    },
    {
      "name": "TypeScript",
      "level": "Непогано",
      "description": "Розробка типобезпечних додатків з використанням інтерфейсів, дженериків та просунутих можливостей типізації."
    },
    {
      "name": "Angular",
      "level": "Думаю, непогано",
      "description": "Створення компонентно-орієнтованих додатків з використанням сервісів, маршрутизації та управління станом."
    },
    {
      "name":"Vue.js",
      "level":"Багато",
      "description":"Маю досвід роботи з Vue.js, ми використовуємо Vue практично у всіх наших проектах."
    },
    {
      "name":"React",
      "level":"Базові знання",
      "description":"Розуміння компонентної архітектури, хуків та управління станом за допомогою Redux."
    },
    {
      "name":"SASS/SCSS",
      "level":"Комфортно",
      "description":"Використання препроцесорів для більш підтримуваного та організованого CSS з змінними, міксинами та вкладеністю."
    }
  ],
  "backendSkills": [
    {
      "name": "Spring Boot",
      "level": "Трохи працював",
      "description": "Розробка серверних додатків з використанням подієво-орієнтованої архітектури та неблокуючих операцій введення-виведення."
    },
    {
      "name": "FastAPI",
      "level": "Більш ніж достатньо",
      "description": "Створення RESTful API з використанням проміжного ПЗ, маршрутизації та обробки помилок."
    },
    {
      "name": "PostgreSQL",
      "level": "Добре розбираюсь",
      "description": "Робота з просунутими можливостями реляційних баз даних, включаючи індексування, транзакції та збережені процедури."
    },
    {
      "name": "SQL",
      "level": "Достатньо добре",
      "description": "Робота з реляційними базами даних, написання запитів та управління відносинами в базі даних."
    },
    {
      "name": "Java",
      "level": "Більше ніж основи",
      "description": "Розробка корпоративних додатків з використанням Spring Boot та інших фреймворків."
    },
    {
      "name": "Python",
      "level": "Поточний активний",
      "description": "Створення скриптів автоматизації, аналіз даних та розробка веб-додатків з використанням Django та Flask."
    },
    {
      "name":"C#",
      "level":"Основи",
      "description":"Знання синтаксису та розуміння принципів об'єктно-орієнтованого програмування."
    }
  ],
  "otherSkills": [
    {
      "name": "Git & GitHub",
      "level": "Використовую щодня",
      "description": "Контроль версій, спільна розробка, стратегії гілкування та робочі процеси CI/CD."
    },
    {
      "name": "RESTful APIs",
      "level": "Стандартний підхід",
      "description": "Проектування та використання API відповідно до принципів REST, з правильними кодами стану та обробкою помилок."
    },
    {
      "name": "Responsive Design",
      "level": "Повинен знати",
      "description": "Створення макетів, що адаптуються до різних розмірів екрану, з використанням медіа-запитів та підходу mobile-first."
    },
    {
      "name": "Docker",
      "level": "Робив багато разів",
      "description": "Контейнеризація додатків, створення та управління Docker-образами та контейнерами."
    },
    {
      "name": "CI/CD",
      "level": "Кілька разів",
      "description": "Налаштування та підтримка конвеєрів безперервної інтеграції та доставки з використанням GitHub Actions, GitLab CI/CD та інших інструментів."
    },
    {
      "name":"Google Cloud",
      "level":"Маю деякий досвід",
      "description":"Розгорнув усі наші проекти в BFH в Google Cloud, використовуючи Docker Cloud Run, Cloud SQL та Artifact registry."
    },
    {
      "name":"Agile Методології",
      "level":"Знання",
      "description":"Плюс роботи в університеті - була можливість відвідати тижневі семінари, пов'язані з управлінням проектами за SCRUM та AGILE. Які я використовував у подальшому робочому процесі."
    }
  ],
  "techStack": [
    "JavaScript",
    "TypeScript",
    "Angular",
    "Vue.js",
    "Vanilla JS",
    "Python",
    "FastAPI",
    "Java",
    "Spring Boot",
    "C#",
    "Git - GitHub/GitLab",
    "Docker",
    "CI/CD"
  ]
}
